<<<<<<< HEAD
#include <stdio.h> // Заголовочный файл функций ввода-вывода
#include <math.h> // Заголовочный файл математических функций
#include <stdlib.h> // Заголовочный файл стандартной библиотеки
=======
#include <stdio.h> // Р—Р°РіРѕР»РѕРІРѕС‡РЅС‹Р№ С„Р°Р№Р» С„СѓРЅРєС†РёР№ РІРІРѕРґР°-РІС‹РІРѕРґР°
#include <math.h> // Р—Р°РіРѕР»РѕРІРѕС‡РЅС‹Р№ С„Р°Р№Р» РјР°С‚РµРјР°С‚РёС‡РµСЃРєРёС… С„СѓРЅРєС†РёР№
#include <stdlib.h> // Р—Р°РіРѕР»РѕРІРѕС‡РЅС‹Р№ С„Р°Р№Р» СЃС‚Р°РЅРґР°СЂС‚РЅРѕР№ Р±РёР±Р»РёРѕС‚РµРєРё
>>>>>>> 37866f873303dd617549c9dcaa40cdbe6b8b0a17

int task1(float x, float y);
float task2(float x);

int main(void)
{
<<<<<<< HEAD
	system("chcp 1251"); // Переход в консоли на русский язык
	system("cls"); // Очистка консоли

	float x, y, f; // Объявление параметров для функции
	int n; // Объявление переменной пользовательского выбора
	
	printf("Выберите номер задания: 1 или 2?\n");
	scanf_s("%d", &n);
	printf("\n"); // Отступ между вводом задания и решением
	
	switch (n)
	{
	case 1: // Выбор первого задания
	{

		printf("Вы выбрали задание 1\n");
		printf("Введите X: ");
		scanf_s("%f", &x);
		printf("Введите Y: ");
		scanf_s("%f", &y);
		printf("Результат: %d\n", task1(x, y));
=======
	system("chcp 1251"); // РџРµСЂРµС…РѕРґ РІ РєРѕРЅСЃРѕР»Рё РЅР° СЂСѓСЃСЃРєРёР№ СЏР·С‹Рє
	system("cls"); // РћС‡РёСЃС‚РєР° РєРѕРЅСЃРѕР»Рё

	float x, y, f; // РћР±СЉСЏРІР»РµРЅРёРµ РїР°СЂР°РјРµС‚СЂРѕРІ РґР»СЏ С„СѓРЅРєС†РёРё
	int n; // РћР±СЉСЏРІР»РµРЅРёРµ РїРµСЂРµРјРµРЅРЅРѕР№ РїРѕР»СЊР·РѕРІР°С‚РµР»СЊСЃРєРѕРіРѕ РІС‹Р±РѕСЂР°
	
	printf("Р’С‹Р±РµСЂРёС‚Рµ РЅРѕРјРµСЂ Р·Р°РґР°РЅРёСЏ: 1 РёР»Рё 2?\n");
	scanf_s("%d", &n);
	printf("\n"); // РћС‚СЃС‚СѓРї РјРµР¶РґСѓ РІРІРѕРґРѕРј Р·Р°РґР°РЅРёСЏ Рё СЂРµС€РµРЅРёРµРј
	
	switch (n)
	{
	case 1: // Р’С‹Р±РѕСЂ РїРµСЂРІРѕРіРѕ Р·Р°РґР°РЅРёСЏ
	{

		printf("Р’С‹ РІС‹Р±СЂР°Р»Рё Р·Р°РґР°РЅРёРµ 1\n");
		printf("Р’РІРµРґРёС‚Рµ X: ");
		scanf_s("%f", &x);
		printf("Р’РІРµРґРёС‚Рµ Y: ");
		scanf_s("%f", &y);
		printf("Р РµР·СѓР»СЊС‚Р°С‚: %d\n", task1(x, y));
>>>>>>> 37866f873303dd617549c9dcaa40cdbe6b8b0a17
	}
	break;
	case 2:
	{
<<<<<<< HEAD
		printf("Вы выбрали задание 2\n");
		printf("Введите Х: ");
		scanf_s("%f", &x);
		printf("Результат: %.2f\n", task2(x));
	}
	break;
	default:
		printf("Введено некорректное значение\n");
=======
		printf("Р’С‹ РІС‹Р±СЂР°Р»Рё Р·Р°РґР°РЅРёРµ 2\n");
		printf("Р’РІРµРґРёС‚Рµ РҐ: ");
		scanf_s("%f", &x);
		printf("Р РµР·СѓР»СЊС‚Р°С‚: %.2f\n", task2(x));
	}
	break;
	default:
		printf("Р’РІРµРґРµРЅРѕ РЅРµРєРѕСЂСЂРµРєС‚РЅРѕРµ Р·РЅР°С‡РµРЅРёРµ\n");
>>>>>>> 37866f873303dd617549c9dcaa40cdbe6b8b0a17
		break;
	}

	system("pause");
	return 0;
}

int task1(float x, float y)
{
<<<<<<< HEAD
	if ((x <= 1 && x >= -1) && (y <= 1 && y >= -1)) // Попадание в квадрат
		if (x > 0 && y < 0) return 0; // Попадание в нижнюю правую четверть
=======
	if ((x <= 1 && x >= -1) && (y <= 1 && y >= -1)) // РџРѕРїР°РґР°РЅРёРµ РІ РєРІР°РґСЂР°С‚
		if (x > 0 && y < 0) return 0; // РџРѕРїР°РґР°РЅРёРµ РІ РЅРёР¶РЅСЋСЋ РїСЂР°РІСѓСЋ С‡РµС‚РІРµСЂС‚СЊ
>>>>>>> 37866f873303dd617549c9dcaa40cdbe6b8b0a17
		else return 1;
	else return 0;
}

float task2(float x)
{
	float f;
	x <= -3 ? (f = (x*x + 3*x + 9)) : (f = ((sin(x)) / (x*x - 9)));
	return f;
<<<<<<< HEAD
}
=======
}

>>>>>>> 37866f873303dd617549c9dcaa40cdbe6b8b0a17
